app/views/likes/_like_links.html.erb

<% if current_user.likes.find_by(event_id: event.id) %>
---
SELECT  "likes".* FROM "likes" WHERE "likes"."user_id" = ? AND "likes"."event_id" = ? LIMIT 1  [["user_id", 3], ["event_id", 3]]