app/views/likes/like.js.erb

SELECT COUNT(*) FROM "likes" WHERE "likes"."event_id" = ?  [["event_id", 1]]
---

$('#like-count').html('<%= @event.likes.count %>');