app/views/likes/unlike.js.erb


$('#like-count').html('<%= @event.likes.count %>');
---
SELECT COUNT(*) FROM "likes" WHERE "likes"."event_id" = ?  [["event_id", 1]]