app/views/events/_form.html.erb


  <% userArray=User.all.select{|u| u.name unless u==current_user }%>
---
SELECT "users".* FROM "users"