app/views/events/show.html.erb

SELECT  "likes".* FROM "likes" WHERE "likes"."user_id" = ? AND "likes"."event_id" = ? LIMIT 1  [["user_id", 2], ["event_id", 3]]
SELECT COUNT(*) FROM "likes" WHERE "likes"."event_id" = ?  [["event_id", 3]]
---
  <small>
    <%= link_to @event.likes.count, liking_users_event_path(@event.id), id:"like-count", remote: true %>人がいいね！といっています