app/controllers/events_controller.rb

  def create
    @event = current_user.events.build(event_params)
    respond_to do |format|
      if @event.save
---
INSERT INTO "events" ("title", "content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Test1"], ["content", "Test1"], ["user_id", 1], ["created_at", "2016-07-30 09:23:56.910033"], ["updated_at", "2016-07-30 09:23:56.910033"]]