app/controllers/likes_controller.rb

SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT 1  [["id", 2]]
INSERT INTO "likes" ("event_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["event_id", 2], ["user_id", 2], ["created_at", "2016-07-31 03:57:34.942696"], ["updated_at", "2016-07-31 03:57:34.942696"]]
---
  def like
    @event= Event.find(params[:event_id])
    like = current_user.likes.build(event_id: @event.id)
    like.save

SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT 1  [["id", 2]]
SELECT  "likes".* FROM "likes" WHERE "likes"."user_id" = ? AND "likes"."event_id" = ? LIMIT 1  [["user_id", 2], ["event_id", 2]]
DELETE FROM "likes" WHERE "likes"."id" = ?  [["id", 1]]
---
  def unlike
    @event = Event.find(params[:event_id])
    like = current_user.likes.find_by(event_id: @event.id)
    like.destroy