app/controllers/users_controller.rb

  def show
    @events = Event.all.order(created_at: :desc)
---
SELECT "events".* FROM "events"  ORDER BY "events"."created_at" DESC

  def update
    file = params[:user][:image]
    @user.set_image(file)
    respond_to do |format|
      if @user.update(user_params)
---
UPDATE "users" SET "about" = ?, "city" = ?, "interest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["about", "I am Keisuke"], ["city", "Tokyo"], ["interest", "Fuck"], ["updated_at", "2016-07-30 17:02:49.392122"], ["id", 1]]